##### 唯一作业:

- 可回放的点彩画板
- 期待:
    + 三种形状画笔可选: 三角/方形/圆形
    + 颜色可定义: 颜色名 或是 RGB 声明
    + 每次 鼠标 点击画板任意一处,都绘制一个当前画笔可用彩色形状
    + 可记录1024次点彩绘制行为
    + 可回放整个记录的绘制行为
- 要求:
    + 基础: 有画笔,可点绘
    + 可用: 有画笔,有颜色,可点绘
    + 合格: 有画笔,有颜色,可点绘,可回放
    + 天才: 有画笔,有颜色,可点绘,可回放,回放速度可调节,回放可输出为文件



##### 设计步骤：
从最简单的开始
1. 创建框，画布背景设置为白色`set_canvas_background('White')`
2. 画笔形状，要求三种形状：三角/方形/圆形，在`Canvas`中只找到`Draw Circle on Canvas`，就先画园吧，用按钮进行选择
3. 颜色，原本设想用下拉框选择，但没找到这种方式，所以依然用按钮的方式，定义几个函数赋值颜色的字符串，注册按钮并调用函数
4. 点绘，注册鼠标点击事件`set_mouseclick_handler(click)`，定义函数`draw`将坐标转换成列表，先画出圆形
5. 颜色有了，得想办法画三角和方形，找了一下，在` Canvas`，`Examples:`，`Drawing Shapes`里面画了几种图形，有需要的三角和方形，
   依葫芦画瓢，用获取的鼠标点击坐标加减25像素，确定了几个顶点，然后是边框、填充色。
   方形遇到点问题，几个顶点的顺序不对，画得很诡异，仔细研究了一下，从左上角逆时针画了一圈，问题解决。
现在可以点绘，但历史信息没有被记录，接下来要用到列表保存每次点击的信息了
[链接](http://www.codeskulptor.org/#user39_OfxcScRKeX_10.py)

6. 列表，考虑到需要保存的信息，列表中要包含：鼠标点击的坐标、颜色、笔画形状，创建了一个列表`Pol_list`，元素用变量替代。
   在鼠标事件的处理函数下，每次的点击坐标追加到`Pol_list`进行保存，同时保存这次点击用到的颜色和形状
[链接](http://www.codeskulptor.org/#user39_OfxcScRKeX_13.py)

7. 回放，最困难的一步，最开始想到的是体育比赛中的录像回放，考虑在列表添加一个`time`做累加，然后用`index`找出位置，
   用`list[0:1024]`截取固定范围赋值给另一个列表名，然后用`range(1024)`和`for in`之类的方法实现。
   但想到这里已经凌乱了，怎么用一个`draw`实现。
   后来想到，或许可以理解为回退呢？先做手动回放功能
   然后考虑怎么用一个`draw`显示正常绘画和回退的图像，开始想用全局变量`be``end`表示需要显示的列表范围，`end`在`click`中累加
   怎么在`draw`区分两个范围呢
   用`True`和`False`判断正常绘画还是回退
   回放按钮中定义全局变量`review = True`，当再次用鼠标绘画时，在`click`中重新赋值为`False`，从而显示当前的绘画进度
   同时，在回放函数中设置累加器`n += 1`,在`draw`切换到回放的代码时，每次点击一次回放
   用全局end减去累加器，实现从当前版本回退
   这样，手动回退就完成了
[链接](http://www.codeskulptor.org/#user39_OfxcScRKeX_15.py)

8. 接下来是可变速回放，就需要改为自动回退了，引入计时器，在一定的时间间隔后，自动执行回退函数
   原本想在加速、减速函数中累加不同大小的时间延迟，但好像没有效果，只好定义了三个不同速度的定时器，用不同的开始、结束组合
   实现变速
9. 最后，界面优化，变速时间延迟的调整
[链接](http://www.codeskulptor.org/#user39_JvJKzy99qpcChyq.py)

##### 最后
回放输出为文件，我理解是用字典保存回放时的元素信息，然后尝试打印了一下，结果不太对，还需要研究一下。

有点体会到了“衣带渐宽终不悔，为伊消得人憔悴”的感觉，折腾了一下午，吃晚饭还在想……
